{
  "navigation": {
    "home": "Home",
    "projects": "Projects",
    "about": "About",
    "skills": "Skills",
    "courses": "Courses"
  },
  "home": {
    "greeting": "Hello",
    "name": "I'm Cleriston Pereira",
    "profession": "Full stack web and mobile developer",
    "buttons": {
      "getInTouch": "Get in touch",
      "downloadCV": "Get CV"
    }
  },
  "projects": {
    "title": "Welcome to My Portfolio",
    "description": "Check out the <1>gallery</1> for each project. <1>Click a card</1> to see awesome photos and videos!",
    "reports-registry": {
      "description": "The Reports Registry is a comprehensive web application designed to efficiently manage equipment tests and reports. This integrated solution allows users to register, consult, update, and delete information about equipment, batches, tests, and much more, ensuring compliance with technical standards and facilitating asset management."
    },
    "audience-counter": {
      "description": "The Audience Counter is an application developed to count the audience at events, offering two counting methods: direct counting and row counting. It was designed to facilitate efficient and accurate counting and registration of attendance, with options to save, view, and manage saved counts."
    },
    "audio-transcriber": {
      "description": "Audio Transcriber is an application developed to transcribe audio, using the Google Speech To Text API. It allows users to upload audio files and obtain the corresponding transcription or to record audio using their device's microphone, facilitating access and understanding of spoken content."
    },
    "spring-ionic": {
      "description": "SpringIonic is an application developed with Spring Boot and Ionic that offers a complete platform for creating online stores. The application allows the registration of products, categories, customers, and orders, as well as offering features such as product search, shopping cart management, and payment."
    },
    "webmatriculas": {
      "description": "WebMatriculas is a system for managing enrollments in educational institutions, composed of two parts: a React frontend and a Spring Boot backend. Both communicate through a RESTful API."
    },
    "catalog": {
      "description": "The Catalog project is a web application developed using the Spring framework for the backend and React for the frontend. It was designed to provide a centralized platform where users can manage and view information about various product catalogs."
    },
    "dscommerce": {
      "description": "DSCommerce is a comprehensive web application developed with Spring Boot on the backend and React on the frontend. It allows the management of products, categories, orders, and customers."
    }
  },
  "about": {
    "title": "Let me introduce myself",
    "introduction": "Hi! My name is Cleriston and I'm a web and mobile developer with over 5 years of experience. Throughout my career, I've developed various projects ranging from mobile apps to complex web platforms.",
    "skills": "Currently, I develop applications in <1>Java</1> (backend) and <1>JavaScript</1> (frontend), as well as <1>HTML</1> and <1>CSS</1>. I love working with modern technologies like <1>React, TypeScript</1> and <1>Spring Boot</1>, and I am always learning and improving my skills. I also develop mobile applications with <1>Ionic</1> and <1>Jetpack Compose (Kotlin)</1>.",
    "background": "I've always had an affinity for IT, even though I started my career in the port industry. Even as a Naval Technical Inspector, I was also responsible for assembling and maintaining computers, LAN networks, and developing administrative solutions. I decided to change careers and dedicate myself to the area that always caught my attention and that aligns more with my vocation.",
    "experience": "With the knowledge acquired, I developed the website of the company where I work. In addition, over the past 5 years, I've had the opportunity to work as a freelancer, which has allowed me to collaborate with a variety of clients and companies. I enjoy the challenge of understanding each client's needs and transforming those needs into a functional and well-presented product.",
    "callToAction": "If you're looking for someone to help with your next project, I'd be happy to collaborate. Get in touch and let's talk!",
    "buttons": {
      "seeMore": "See more...",
      "seeLess": "See less...",
      "downloadCV": "Get CV"
    }
  },
  "skills": {
    "title": "Skills",
    "sectionDescription": "A set of technologies that I use to create robust and efficient web and mobile solutions.",
    "experienceYears": "Years of Experience",
    "contact": {
      "label": "Get in touch",
      "phone": "+55 98 9 8199 9361"
    }
  },
  "courses": {
    "title": "Courses completed",
    "sectionDescription": "Below are some of the main courses I've completed.",
    "completionDate": "Completion date: {{date}}",
    "courseLoad": "Course load: {{hours}} hours",
    "seeMore": "See more",
    "topicSubject": "{{subject}}",
    "topicDescription": "{{description}}"
  },
  "footer": {
    "contact": "contact me",
    "copyright": "© {{year}} CleristonMP - All rights reserved."
  }
}
