{
  "navigation": {
    "home": "Home",
    "projects": "Projetos",
    "about": "Sobre",
    "skills": "Skills",
    "courses": "Cursos"
  },
  "home": {
    "greeting": "Olá",
    "name": "Eu sou Cleriston Pereira",
    "profession": "Desenvolvedor Full stack web e mobile",
    "buttons": {
      "getInTouch": "Entre em contato",
      "downloadCV": "Baixar CV"
    }
  },
  "projects": {
    "title": "Bem-vindo ao Meu Portfólio",
    "description": "Explore a <1>galeria</1> de cada projeto. <1>Clique em um card</1> para ver fotos e vídeos incríveis!",
    "reports-registry": {
      "description": "O Reports Registry é uma aplicação web completa, desenvolvida para gerenciar de forma eficiente testes e relatórios de equipamentos. Essa solução integrada permite aos usuários cadastrar, consultar, atualizar e excluir informações sobre equipamentos, lotes, testes e muito mais, garantindo a conformidade com as normas técnicas e facilitando a gestão de ativos."
    },
    "audience-counter": {
      "description": "O Audience Counter é um aplicativo desenvolvido para contar o público em eventos, oferecendo dois tipos de contagem: contagem direta e contagem por fileiras. Ele foi projetado para facilitar a contagem e registro da assistência de forma eficiente e precisa, com opções para salvar, visualizar e gerenciar as contagens salvas."
    },
    "audio-transcriber": {
      "description": "O Audio Transcriber é um aplicativo desenvolvido para transcrever áudios, utilizando a API Google Speech To Text. Ele permite que os usuários façam upload de arquivos de áudio e obtenham a transcrição correspondente ou que gravem um áudio utilizando o microfone de seu dispositivo, facilitando o acesso e a compreensão do conteúdo falado."
    },
    "spring-ionic": {
      "description": "O SpringIonic é uma aplicação desenvolvida com Spring Boot e Ionic que oferece uma plataforma completa para a criação de lojas virtuais. A aplicação permite o cadastro de produtos, categorias, clientes e pedidos, além de oferecer funcionalidades como busca de produtos, gerenciamento de carrinho de compras e pagamento."
    },
    "webmatriculas": {
      "description": "O WebMatriculas é um sistema para gestão de matrículas em instituições de ensino, composto por duas partes: um frontend em React e um backend em Spring Boot. Ambos se comunicam por meio de uma API RESTful."
    },
    "catalog": {
      "description": "O projeto Catalog é uma aplicação web desenvolvida usando o framework Spring para o backend e React para o frontend. Ele foi projetado para fornecer uma plataforma centralizada onde usuários podem gerenciar e visualizar informações sobre diversos catálogos de produtos."
    },
    "dscommerce": {
      "description": "O DSCommerce é uma aplicação web completa desenvolvida com Spring Boot no backend e React no frontend. Ele permite a gestão de produtos, categorias, pedidos e clientes."
    }
  },
  "about": {
    "title": "Deixa eu me apresentar",
    "introduction": "Olá! Meu nome é Cleriston e sou um desenvolvedor web e mobile com mais de 5 anos de experiência. Durante minha carreira, desenvolvi vários projetos que vão desde aplicativos móveis até plataformas web complexas.",
    "skills": "Atualmente, desenvolvo aplicações em <1>Java</1> (backend) e <1>JavaScript</1> (frontend), além de <1>HTML</1> e <1>CSS</1>. Amo trabalhar com tecnologias modernas, como <1>React, TypeScript</1> e <1>Spring Boot</1>, e estou sempre aprendendo e aprimorando minhas habilidades. Também desenvolvo aplicativos mobile com <1>Ionic</1> e <1>Jetpack Compose (Kotlin)</1>.",
    "background": "Sempre tive afinidade com a área de TI, apesar de ter iniciado minha carreira na área portuária. Mesmo atuando como Inspetor Técnico Naval, também fui responsável pela montagem e manutenção de computadores, rede LAN e desenvolvimento de soluções administrativas. Decidi mudar de profissão e me dedicar à área que sempre chamou minha atenção e que se alinha mais com minha vocação.",
    "experience": "Com o conhecimento adquirido, desenvolvi o site da empresa onde trabalho. Além disso, ao longo dos últimos 5 anos, tive a oportunidade de trabalhar como freelancer, o que me permitiu colaborar com uma variedade de clientes e empresas. Gosto do desafio de entender as necessidades de cada cliente e transformar essas necessidades em um produto funcional e bem apresentável.",
    "callToAction": "Se você está procurando alguém para ajudar no desenvolvimento do seu próximo projeto, ficarei feliz em colaborar. Entre em contato e vamos conversar!",
    "buttons": {
      "seeMore": "Veja mais...",
      "seeLess": "Veja menos...",
      "downloadCV": "Baixar CV"
    }
  },
  "skills": {
    "title": "Habilidades",
    "sectionDescription": "Um conjunto de tecnologias que utilizo para criar soluções web e mobile robustas e eficientes.",
    "experienceYears": "Anos de Experiência",
    "contact": {
      "label": "entre em contato",
      "phone": "+55 98 9 8199 9361"
    }
  },
  "courses": {
    "title": "Cursos realizados",
    "sectionDescription": "Abaixo estão listados alguns dos principais cursos que já concluí.",
    "completionDate": "Data de conclusão: {{date}}",
    "courseLoad": "Carga horária: {{hours}} horas",
    "seeMore": "Veja mais",
    "topicSubject": "{{subject}}",
    "topicDescription": "{{description}}"
  },
  "footer": {
    "contact": "entre em contato",
    "copyright": "© {{year}} CleristonMP - Todos os direitos reservados."
  }
}
